
## Plan Result (terraform/aws/openhands)

[CI link](https://github.com/boxp/arch/actions/runs/13726537665)


<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_access_key.bedrock_user_key
  * aws_iam_policy.bedrock_policy
  * aws_iam_user.bedrock_user
  * aws_iam_user_policy_attachment.bedrock_policy_attachment
  * aws_ssm_parameter.bedrock_access_key_id
  * aws_ssm_parameter.bedrock_secret_access_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_access_key.bedrock_user_key will be created
  + resource "aws_iam_access_key" "bedrock_user_key" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "bedrock-openhands-user"
    }

  # aws_iam_policy.bedrock_policy will be created
  + resource "aws_iam_policy" "bedrock_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for accessing AWS Bedrock Claude 3.7 Sonnet"
      + id               = (known after apply)
      + name             = "bedrock-openhands-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "bedrock:InvokeModel",
                          + "bedrock:InvokeModelWithResponseStream",
                          + "bedrock:GetModelCustomizationJob",
                          + "bedrock:ListModelCustomizationJobs",
                          + "bedrock:ListFoundationModels",
                          + "bedrock:GetFoundationModel",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:bedrock:us-west-2::foundation-model/anthropic.claude-3-7-sonnet-20250219-v1:0",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_user.bedrock_user will be created
  + resource "aws_iam_user" "bedrock_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "bedrock-openhands-user"
      + path          = "/service/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.bedrock_policy_attachment will be created
  + resource "aws_iam_user_policy_attachment" "bedrock_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "bedrock-openhands-user"
    }

  # aws_ssm_parameter.bedrock_access_key_id will be created
  + resource "aws_ssm_parameter" "bedrock_access_key_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "AWS Access Key ID for Bedrock service"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "bedrock-access-key-id"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.bedrock_secret_access_key will be created
  + resource "aws_ssm_parameter" "bedrock_secret_access_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "AWS Secret Access Key for Bedrock service"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "bedrock-secret-access-key"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2868,"Program":"tfcmt","SHA1":"03a80e6c7659c0c0cd9845ec4cb2f9baa42e5209","Target":"terraform/aws/openhands","Vars":{},"WorkflowName":"pull_request_target"} -->